# GetInsertLocComp

## Description
Gets the insert location component of the object.

```pascal
FUNCTION GetInsertLocComp(object : HANDLE): INTEGER;
```

```python
def vs.GetInsertLocComp(object):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, Wall Style, or the Wall Preferences.|

## See Also
VS Functions:
SetInsertLocComp

## Version
Availability: from Vectorworks 2023

## Category
* Objects - Architectural